In [2]:
print("hello world")

hello world

In [3]:
import pandas as pd

In [4]:
test_df = pd.read_excel("Statement.xlsx")

In [5]:
test_df.head(8)

,Transaction Statement for 8233101894,Unnamed: 1,Unnamed: 2,Unnamed: 3
0,NaN,"01 Jan, 2024 - 30 Sep, 2024",NaN,NaN
1,Date,Transaction Details,Type,Amount
2,"Sep 20, 2024 Paid to Ashok Jayani Citm",NaN,DEBIT,₹10
3,04:14 pm,Transaction ID T2409201614203016273177\nUTR No...,NaN,NaN
4,NaN,Paid by XXXXXX9791,NaN,NaN
5,"Sep 20, 2024 Paid to UJjawal Jindal Ch...",NaN,DEBIT,₹1
6,04:08 pm,Transaction ID T2409201608334262678215\nUTR No...,NaN,NaN
7,NaN,Paid by XXXXXX9791,NaN,NaN

In [10]:
df

,Transaction Statement for 8233101894,Unnamed: 1,Unnamed: 2,Unnamed: 3
1,Date,Transaction Details,Type,Amount
25,"Sep 13, 2024",Paid to Vijay Singh,DEBIT,₹40
28,"Sep 13, 2024",Paid to Ramesh parlour,DEBIT,₹60
31,"Sep 13, 2024",Received from Umesh Kumar,CREDIT,₹500
34,"Sep 13, 2024",Mobile recharged 9997343165,DEBIT,₹22
...,...,...,...,...
1047,"Jan 03, 2024",Paid to HELTHY HUT DOODH DAIRY,DEBIT,₹10
1050,"Jan 02, 2024",Paid to PAPPU LAL SHARMA,DEBIT,₹30
1052,"Jan 02, 2024",Paid to MANGAVA SALES,DEBIT,₹28
1055,"Jan 02, 2024",Paid to Kotak Securities Limited,DEBIT,₹299
1059,"Jan 01, 2024",Paid to MANGAVA SALES,DEBIT,₹60

In [11]:
df.shape

(347, 4)

In [12]:
test_df.shape

(1060, 4)